#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-335209/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-335209/global/networks/main-vpc]
data.google_client_config.provider: Reading...
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-335209-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-335209-data]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-335209"/regions/"europe-west1"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-335209-code-spark-job.py]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-335209/global/firewalls/fw-allow-ingress-iap]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-335209/global/firewalls/allow-all-internal]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-335209/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-335209/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-335209/global/routes/egress-internet]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-335209/composer.googleapis.com]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-335209/dataproc.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-335209/serviceAccounts/tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-335209/roles/composer.worker/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-335209/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-335209-data/roles/storage.objectUser/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-335209/roles/dataproc.editor/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-335209-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-335209/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2024l-335209]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-335209/roles/composer.ServiceAgentV2Ext/serviceAccount:service-143640390419@cloudcomposer-accounts.iam.gserviceaccount.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:db67ff52abc4230dd2901e49a8a459c5844ff28aba5edd8b9fbe22ca185d62fdeu.gcr.io/tbd-2024l-335209/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:4b63be826ab13c5116c3d099fdffae97c022f7a0febd93b7abc26731c2b2e0a8]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2024l-335209/locations/europe-west1/environments/demo-lab]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-335209/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-335209/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-335209-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-335209-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-335209-conf-scripts/notebook_post_startup_script.sh]
data.google_container_cluster.composer-gke-cluster: Reading...
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-38666537-bucket-dags/data-dag.py]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-38666537-bucket-dags/dbt-dag.py]
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:6f5489a6551f280f5313c305b2c43b00cf62db90c7414111b5d32276989431a4eu.gcr.io/tbd-2024l-335209/dbt:1.7.3]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:fa66f758f63be3db61f914636b9e4f60d8943a978d82f695f1bbd34304dd252c]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-335209/locations/europe-west1-b/instances/tbd-2024l-335209-notebook]
data.google_container_cluster.composer-gke-cluster: Read complete after 3s [id=projects/tbd-2024l-335209/locations/europe-west1/clusters/europe-west1-demo-lab-38666537-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id       = "sha256:6f5489a6551f280f5313c305b2c43b00cf62db90c7414111b5d32276989431a4eu.gcr.io/tbd-2024l-335209/dbt:1.7.3"
      - name     = "eu.gcr.io/tbd-2024l-335209/dbt:1.7.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:db67ff52abc4230dd2901e49a8a459c5844ff28aba5edd8b9fbe22ca185d62fdeu.gcr.io/tbd-2024l-335209/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2024l-335209/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env has changed
  ~ resource "google_composer_environment" "composer_env" {
        id               = "projects/tbd-2024l-335209/locations/europe-west1/environments/demo-lab"
      + labels           = {}
        name             = "demo-lab"
        # (4 unchanged attributes hidden)

      ~ config {
            # (8 unchanged attributes hidden)

          ~ node_config {
              + tags                 = []
                # (8 unchanged attributes hidden)
            }

          ~ software_config {
              + airflow_config_overrides = {}
              + pypi_packages            = {}
                # (3 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (7 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_service.dbt-task-service will be updated in-place
  ~ resource "kubernetes_service" "dbt-task-service" {
        id                     = "composer-user-workloads/dbt-task-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                ) -> null
            }
            name             = "dbt-task-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"] must be replaced
-/+ resource "google_storage_bucket_object" "job-code" {
      + content          = (sensitive value)
      ~ content_type     = "text/x-python" -> (known after apply)
      ~ crc32c           = "4nATNA==" -> (known after apply)
      ~ detect_md5hash   = "MlHXMCp8Q6lkf1MBqC4A3w==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "tbd-2024l-335209-code-spark-job.py" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "MlHXMCp8Q6lkf1MBqC4A3w==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/tbd-2024l-335209-code/o/spark-job.py?generation=1713262100129449&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "spark-job.py"
      ~ output_name      = "spark-job.py" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/tbd-2024l-335209-code/o/spark-job.py" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-335209/dbt:1.7.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.3"
              + "PROJECT_NAME"      = "tbd-2024l-335209"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/dbt_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-335209/dbt:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-335209/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.3"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-335209"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-335209/jupyter:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-335209"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-335209/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:143640390419-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-335209-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:143640390419-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @JakubDziegielewski, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*